{
    "comment#1": "nigel so chad",
    "comment#2": "❤",
    "comment#3": "Good movie!!!❤❤❤",
    "comment#4": "I believe in time travel…I wish I can be a hero and change the past …..",
    "comment#5": "6 year old writes the script? so silly 😝",
    "comment#6": "Super movie",
    "comment#7": "good movie",
    "comment#8": "Do not read the comments until you&#39;ve watched the movie. The movie is  good! 👍",
    "comment#9": "I doubt. Why did that Old Man Nighel didn&#39;t say a word to the captian...when he knew that the flight was passing through 1940. And after thr flight stopped, neither the old man - Nigale and the captain discussed about the fact they both were really really thinking about this. If you know what I meant. I don&#39;t understand this logic. Both pretended as of they don&#39;t know",
    "comment#10": "nice film",
    "comment#11": "This movie is worth your time",
    "comment#12": "This movie is very beautful i have ever seen",
    "comment#13": "The best movie ever<br>Thrilling and marvelous and best end Nigel shepherd was in the aeroplane ✈️😳",
    "comment#14": "So amazing movie♡",
    "comment#15": "I like this movie but the two passengers are dies.",
    "comment#16": "<a href=\"https://youtu.be/Qqf8reC4euU?si=0Q2a2pLFJTNWRF5o\">https://youtu.be/Qqf8reC4euU?si=0Q2a2pLFJTNWRF5o</a>",
    "comment#17": "the old man is Nigel, he is veteran",
    "comment#18": "The movie is genius please what&#39;s the real name of Captain Williams please can someone help me please... I really love his movies😍🙏🙏",
    "comment#19": "Like it...has a Twilight Zone feel to it",
    "comment#20": "you got 1 thing wrong they didint come back for 37 years but they thought it was 1 day and not one of them aged up 1 day",
    "comment#21": "Wow what a rollercoaster ride!",
    "comment#22": "Its certainly different to what i expected yet enjoyed",
    "comment#23": "amazing movie.⭐⭐⭐⭐⭐",
    "comment#24": "Lol low budget movies.  Very entertaining even when it’s poorly filmed",
    "comment#25": "Very good movie! Actors very good!",
    "comment#26": "Everyone was happy and laughing 😂😂😂 they all forgot about the two souls they lost 😂😂",
    "comment#27": "The ending was awesome",
    "comment#28": "oh my goodness!!! I am so glad I stopped to watch this! This was great! I almost skipped past it. this deserves 2 or 3 thumbs up!",
    "comment#29": "I like to go back with my ultra Samsung 23 but only disappoint it will not work my phone there 😂",
    "comment#30": "WE DO NOT KNOW HIS NAME BUT HE WAS THE LEAD PILOT?   SPOKE TO THE PASSENGERS ON THE PLANE WAS HONEST WITH THEM(AS SHOULD HAVE BEEN THE CASE).   HE WENT BELOW WITH<br>HECTOR AND THERISA?   HE WAS SUCH A<br>STRONG, POSITIVE PRESENCE, SUCH CHARISMA AND CHARM.  A GREAT JOB🎭👍.  WE WOULD LIKE TO SEE HIM IN OTHER ROLES.   GREAT JOB TO ALL👍.         😇🎤.",
    "comment#31": "Awesome movie. tense by time. Really enjoyed it. Thank you Primetime",
    "comment#32": "To together",
    "comment#33": "❤❤❤best movie ever wow🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉",
    "comment#34": "enjoy life everyday",
    "comment#35": "I like acting enemy plane hansome man and scaring😅",
    "comment#36": "I love this movie ❤",
    "comment#37": "REAALY good movie!!",
    "comment#38": "Good movie …only the thing what I felt negative is nobody talking about the passengers who sucked out from the plane ….",
    "comment#39": "What do a Messersmith 262 do fighting in 1940? A bit too early for that. The Me 262 was the german twin engine jet fighter seen briefly early in the movie. Those where simply not operational that early in the war. Having seen the movie now I must conclude that this isn&#39;t the first od technology transfer.",
    "comment#40": "I felt sure they were going to land to a sea of Nazi flags!",
    "comment#41": "Wow! Superb<br>Nigel is real hero😊",
    "comment#42": "Awwwwwwww🥺",
    "comment#43": "Movie is a joke!",
    "comment#44": "I love Nigel he is a hero",
    "comment#45": "The end bit was the best",
    "comment#46": "He spoke to the young boy Nigel then met the old man Nigel. Love the film amazing xx",
    "comment#47": "Loved this --- suspense all the way to the end!!!! En",
    "comment#48": "Thanks for the good movie, Primetime",
    "comment#49": "I love this movie,this pilot really tried ✌️✌️",
    "comment#50": "The guy who played the captain is amazing! Great actor and very sexy",
    "comment#51": "Poilet is don&#39;t know dangerous place..",
    "comment#52": "Way he go war country. He don&#39;t know..?",
    "comment#53": "Anyway. Wouldn&#39;t it be nice to land in Africa in sted of Berlin during to the circumstances. Great movie if it was only 15 minutes long.",
    "comment#54": "Captain danial look like indian actor boby deol 😂",
    "comment#55": "Very nice movie",
    "comment#56": "Damm Good Movie !!!!!",
    "comment#57": "My j up",
    "comment#58": "Woow this was a mind blowing movie 🤯 ❤",
    "comment#59": "Great movie thanks for sharing, we thank God and the Angel Nigel in the plain and the 2 brave Hector and Theresa for their help.",
    "comment#60": "good movie",
    "comment#61": "Love the ending, Nigel!!!!!",
    "comment#62": "One of the best movie I watched.",
    "comment#63": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=1h14m34s\">1:14:34</a> Dan: Nigel you beautiful bastard",
    "comment#64": "I have an one question i.e what is the present year according this movie please give me answer",
    "comment#65": "Hector - not all heroes wear capes.",
    "comment#66": "If this happened to the F22, oh YEA dud.",
    "comment#67": "Che stronzata colossale , tutti i finestrini laterali spaccati e il portellone di emergenza saltato in aria e l&#39;aereo continuava a volare a 8 km di altezza come se niente fosse.",
    "comment#68": "Happy hawoleen 🎉❤❤👻",
    "comment#69": "Awesome movie i really enjoyed watching.",
    "comment#70": "<a href=\"https://youtu.be/WnLkZZgia-0?si=aS1wmR6oTTzmOGja\">https://youtu.be/WnLkZZgia-0?si=aS1wmR6oTTzmOGja</a>",
    "comment#71": "Very nice movie,, I like it especialy the last part,,",
    "comment#72": "Wow 😮😮😮 the ending ❤️",
    "comment#73": "My palpitation triggered by this beautiful movie but then I finish this til the end for sure😂❤",
    "comment#74": "So amzing this movie! Really love most of all nigel and the captain! Bravo!",
    "comment#75": "The movies is very good. Interesting and  has a great twist.  Only problems  I found was  not  with the movie itself but that every two minutes almost the film was constantly being interrupted by ads repeatedly. I know those who have  these things make money from  them, but holy crap.. that&#39;s ridiculous. For other movies I&#39;ll try another channel thx. Time wise, it seemed like there was more time given to ads than the actual movie in my opinion.",
    "comment#76": "The movie reminds me of &quot;The Odyssey of Flight 33,&quot; a Twilight Zone episode in which Global Airlines Flight 33, a commercial aircraft, unintentionally passes through the sound barrier and returns to 1939.The pilot attempts to locate and re-enter the same slipstream.",
    "comment#77": "Who wrote this crap?!?   🙉🙈🙊",
    "comment#78": "Amazing movie",
    "comment#79": "See he rage up",
    "comment#80": "He rage handphone",
    "comment#81": "pan am 914",
    "comment#82": "<a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a>",
    "comment#83": "Amazing flight",
    "comment#84": "👏👏👏👏 Good job captain thank you for sharing",
    "comment#85": "This film Absolutely reminds me the only and the one SAVIOR  is JESUS CHRIST❤❤❤❤❤❤❤❤❤❤",
    "comment#86": "Wooooooooooowwww!!!!!!!!!!",
    "comment#87": "Good movie right throughout the movie I was hoping Daniel will be alright due to the fact that he got shot I enjoyed it I love the part where they all worked together",
    "comment#88": "If he is a real soldier who can physically defend hi.self like a manwithout a weapon in his hand he wouldn&#39; t insuch an unmanly way talk to a civilian like that😮😮😮",
    "comment#89": "This is the reason why I love being completed hated by girls n women all over the world cause they like men who foolishly genuinely respect them love them believe in them etc😊😊😊😊😊",
    "comment#90": "The old man is actually nigel",
    "comment#91": "This is a good movie!!",
    "comment#92": "Interesting movie",
    "comment#93": "I So much love this movie",
    "comment#94": "Nice movie to watch. Recommend for you. 😊",
    "comment#95": "Try using non visible edits",
    "comment#96": "🤔Why t f did Germany have ME 262&#39;s in 1940 &amp; Britain surface to air missiles but still propeller fighters 🤷‍♂️And why did an airliner with a passenger capacity in the hundreds only have like 20 passengers on board? And let&#39;s not mention a &quot;handyman&quot; splicing cables &amp; swinging from the nose gear🙄 or the plane not disintegrating from massive decompression. Stupidest movie i ever saw",
    "comment#97": "Wow what a movie..all things are possible as we now are questioning everything .Thank you ..a great thought provoking script.",
    "comment#98": "THE TWIST CANNOT EXPECT.....",
    "comment#99": "Worth watching",
    "comment#100": "Ok there are suppose to be 3 people in the cockpit at all times.The pilot and 2 co-pilots. This movie is not accurate.",
    "comment#101": "I so much ❤ love this movie 🎥🍿 its inspired me a lot 🎉&quot;anything is possible if have faith&quot;",
    "comment#102": "Awesome movie!!!!!!😮",
    "comment#103": "Wow",
    "comment#104": "Wow Nigel Saterfield books 🙏",
    "comment#105": "I truly love this movie ❤❤❤",
    "comment#106": "Awesome movie",
    "comment#107": "The paint is dry <br>Time for the second coat",
    "comment#108": "WOW this pilot is formidable",
    "comment#109": "Based on true story??????",
    "comment#110": "Wooow a great round of applause 👏👏👏 to the pilots they were great communicaters ,i was holding my heart the whole movie 😮 ,such a good movie 🌟",
    "comment#111": "Hmm...that&#39;s Jimmy Fallon alright. He&#39;s gonna break character any time now...guaranteed!🤨",
    "comment#112": "It looks like the other passenger whos wearing eye glases is filipino also who help the captain where they are",
    "comment#113": "I would have expected all the damage done to the plane would have been healed travelling back to the present. And what of the two people sucked out of the plane. What do you tell their families? Action movie but, like the plane, ended with a few holes in it.",
    "comment#114": "I could&#39;nt believe that man at the back is nigel 😬 this is the best movie for me but wait wheres the two passenger.🥺",
    "comment#115": "I like the plot twist of this movie, I didnt expect that Nigel the only man who save them is one of the passenger in flight 914, Nigel was lucky to experience time travel back to his time❤❤❤",
    "comment#116": "amazing",
    "comment#117": "Wow so nice amazing movie  👏👏👏👏👏",
    "comment#118": "❤❤❤❤",
    "comment#119": "Wawu they skipped death",
    "comment#120": "the movie made me feel the action in it and at the end was just wonderful just wonderfull",
    "comment#121": "Skil tingkat dewa,pesawat komersil serasa pesawat tempur, ikut tegang100%trims sudah apload",
    "comment#122": "Great movie.... I love it...❤️❤️❣️❣️❣️",
    "comment#123": "Nigel literally was in that plane😮",
    "comment#124": "Great to see a couple of history professors as super heroes .",
    "comment#125": "I saw this about 6 months or more ago. It was tremendously entertaining both time. These are the kind of films I prefer to watch.",
    "comment#126": "😅😅lol how come Nigel was in the war zone,,I love the middle of the movie so scary but challenges",
    "comment#127": "Wow best movie❤❤",
    "comment#128": "👍🏻👍🏻🇰🇼🇱🇰👏🏻",
    "comment#129": "Omg! What a nice movie. Glad this shows up as recommendation, it&#39;s been a while since I&#39;ve seen a movie thay kept me seated. <br>I just wished Captain Strong and Nigel had a little chitchat in the ending part. But overall  9/10. This is better than overrated new films.<br><br>New subscriber here. More of like this please. ❤🎉<br>Thank you for uploading this movie.<br><br>Will definetely recommend it to my friends. Give a 👍 if you are watching it days after October 18, 2023.",
    "comment#130": "Good one🔥",
    "comment#131": "This movie is Boss👌🤞❤",
    "comment#132": "❤",
    "comment#133": "What a great movie❤",
    "comment#134": "Kyk naik metro mini😂😂😂😂",
    "comment#135": "The last part that they are about to land was 😭😭😭😭😭 thanks God I am safe 🙏🙏🙏🙏",
    "comment#136": "Mcm sial alur ceritanya tak bermutu langsung",
    "comment#137": "Best movie....menegangkan bgt cerita,... terbaik 👍👍👍",
    "comment#138": "♥️♥️♥️♥️",
    "comment#139": "I LOVED IT ! Good writing, good . . . . . . everything.😁😁😁",
    "comment#140": "I was surprised to see Peter pan (once upon a time) playing Nigel in here.",
    "comment#141": "If you liked this one,checkout the movie Flight 7500,it’s much more absorbing and with many twists and turns ✈️ 👍",
    "comment#142": "Cameron saved this movie.",
    "comment#143": "Amazing movie,  very intense ❤",
    "comment#144": "What an amazing film!!!",
    "comment#145": "Love airplane disaster movies !!!!<br>Well alot of people don&#39;t think time travel is possible........well just check the clock in one hour, and you&#39;ll see that it is.......",
    "comment#146": "Patricia. My name sake, it  just a movie",
    "comment#147": "Is this Jimmy Fallon",
    "comment#148": "Exiting and nice story. Exalent film❤❤❤❤",
    "comment#149": "Watching those ME262s flying so close to the plane was extremely sketchy for a historian like myself. Seeing those Heinkels and Junkers bombers bombing St Nazaire was really scary too. I couldn&#39;t believe being in a commercial jetliner during those moments.",
    "comment#150": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=56m37s\">56:37</a> Sounds Like crash Bash Sounds from that evil doctor that helps cortex xD",
    "comment#151": "The editing has me 💀💀",
    "comment#152": "Goosebumps the last part.goodjob to the one who wrote the story.",
    "comment#153": "Imagine this what happened to the people in planes and boats in the Bermuda triangle.",
    "comment#154": "The plane went into a Bermuda triangle 📐, another thing beginning!",
    "comment#155": "what about the lady that got blown away? tears in my eyes",
    "comment#156": "Nice movie but not good acting",
    "comment#157": "Lovely--Movie<a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a><a href=\"about:invalid#zCSafez\"></a>",
    "comment#158": "Absolutely amazing movie🤩 really enjoyed.ppl should stop mentioning in the comments about the movie let it be a suspense.Lucky I read the comments after watching the movie.The movie actually gave me chills😍👍",
    "comment#159": "nigel in 1940 was the old man sitting behind",
    "comment#160": "The body of 2 passengers are stack in 1940",
    "comment#161": "Cool!",
    "comment#162": "Im so scared😮😢❤❤❤❤🙏🙏🙏🙏",
    "comment#163": "so no one noticed the lady that went missing from that wide gap at the planes wall",
    "comment#164": "WWII was not Hitlers era..his from WWI",
    "comment#165": "Nice captain ❤❤❤",
    "comment#166": "Truly impressed! Yay Nigel!!",
    "comment#167": "the ending the old man was nigel omg",
    "comment#168": "Stewardess grabbing the fire extinguisher was fantastic. They should have a couple fire extinguisher on the plane!",
    "comment#169": "Great Movie for bing Hokie👍",
    "comment#170": "A big unarmed airliner can survive from German fighter planes 😊 Hollywood. German fighter pilots are not that incompetent. In 2nd World War, B-17 and B-29 easily bought down by Nazi planes 😂 Hollywood is just make believe entertainment. To kill Hitler? Oh pleaze, it&#39;s not that easy, Hitler surrounded by armed German troops. Hollywood makes its sound so easy",
    "comment#171": "Rare to find an interesting movie like this.  Loved that twist at the end, though I did suspect it!",
    "comment#172": "Great movie!!! Thank you for posting",
    "comment#173": "Very well done movie!!! Thx for sharing!!",
    "comment#174": "The granpa is nigel 🤷🏽‍♂️",
    "comment#175": "Wow this is the best movie ever ❤️I salute the two pilots ❤😊",
    "comment#176": "A must watch",
    "comment#177": "What is a Me262 doing in 1940 ?  Bf110s were not prototypes in 1940. Explains the alternate timeline but the historian should have picked up on it immediately.",
    "comment#178": "This is a GREAT movie!! I loved the ending...",
    "comment#179": "This movie came out in another channel but it got deleted. And nobody cares about the 2 passengers who flew out and died??",
    "comment#180": "Soon into the movie I am enjoying it.",
    "comment#181": "Wow👏👏👏👏",
    "comment#182": "Was he Nigel II really in the end",
    "comment#183": "I wish have part 2 ❤❤❤ amazing movie",
    "comment#184": "Wow....scene from the air.........is this a true to life story?from Berlin Germany flight 942?",
    "comment#185": "Abeg clear road for the captain",
    "comment#186": "very very nice concept and great movie, eye-catching , its all about faith and confidence",
    "comment#187": "Nigel Nigel",
    "comment#188": "Bullshit movie",
    "comment#189": "Best movie",
    "comment#190": "Amazing 👏👍",
    "comment#191": "god iloveit",
    "comment#192": "This is really amazing ❤",
    "comment#193": "Huraaaa",
    "comment#194": "𝑨𝒎𝒂𝒛𝒖𝒏𝒈 𝒎𝒐𝒗𝒊𝒆 𝒍𝒐𝒗𝒆 𝒊𝒕",
    "comment#195": "WOW, don&#39;t miss this one!  Buckle up and enjoy! It&#39;s the one you&#39;ve been looking for!",
    "comment#196": "COOLEST ENDING EVER!",
    "comment#197": "ok that was weird and cool ending, talking to Nigel and him being on the same plane now",
    "comment#198": "Was anyone able to read the notebook that the old man at the end of the movie was writing in? The front of the book said Nigel Sheffield II and that was the name of the guy on the ground talking to them over the radio. I wonder what he was writing in to the notebook before he got off the plane...  lol. Let me know if anyone was able to make out what he was writing about...",
    "comment#199": "Brilliant movie - the only negative is that it is emotionally exhausting - lots of suspense and big bangs!! 😂😂✈✈. Great ending.  Probably should be avoided by those scared of flying!",
    "comment#200": "The old passenger, the one that never get angry, worried or speak/interact, during the first scenes he was listening to the conversation about the Hitler’s Argentina Map. White hair and beard, old aged, very low profile almost invisible, has lived in Argentina… could the “old passenger” be Hitler?",
    "comment#201": "What a film it had me on the edge of my seat.",
    "comment#202": "Nice movie, but technicallyband historically very un acurat. There where no ME262&#39;s jet figthers in 1940, they only apeared after 43. Also the modern boeing is quite faster then those messersmidts, about a 200 km/h probably. A modern passenger airplan has a pressurized hull so it could just clime to a higher altitude where the fighters would not be able to go.",
    "comment#203": "you on the Bermudez triangle",
    "comment#204": "Wonderful film ..",
    "comment#205": "The best, don’t want to blink even in a second. This is kind of movie i like. And looking for.",
    "comment#206": "This film kept me spell bound. Kai! I enjoyed it.",
    "comment#207": "This film is so far fetched it&#39;s entertaining.",
    "comment#208": "👍",
    "comment#209": "nice movie from start  to end....2nd time watching...",
    "comment#210": "Wonderful to watch",
    "comment#211": "This is an incredible movie ❤🎉",
    "comment#212": "What an amazing movie to watch. Love it!",
    "comment#213": "Kudos to Nigel, Captain and all the crew members incl those who helped 🎉🎉🎉 what an amazing and interesting movie 🎉🎉",
    "comment#214": "What a nice movie to watch 🎉",
    "comment#215": "What a great movie! Kudos to the actors! 👏🏻👏🏻",
    "comment#216": "That&#39;s why I don&#39;t like to be a pilot .",
    "comment#217": "This movie was incredible 10/10",
    "comment#218": "Amazing movie❤❤❤",
    "comment#219": "This is really a great movie",
    "comment#220": "Very good. Try it!",
    "comment#221": "Awesome film I loved it . I’d watch it again.",
    "comment#222": "Wow wow I don&#39;t know the actors but sure they killed it hope seen them again in another movies",
    "comment#223": "Seems the movie was related to the aeroplane which got lost in the air using time travel",
    "comment#224": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=29m54s\">29:54</a> - I can&#39;t do it Captain, I&#39;ve got to have 30 minutes!",
    "comment#225": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=20m42s\">20:42</a> - No man has the right to do this to any woman - ever!",
    "comment#226": "best movie ever loved  it",
    "comment#227": "Very Good 😀",
    "comment#228": "I agree with the post, that said, nobody mentions the 2 passengers, who got blown out the plane😢😢",
    "comment#229": "great movie! loved the ending!!",
    "comment#230": "Everything is wrong, a wheater radar system won&#39;t do long range aircraft detection, 3 bullets to an airliner and it will be a chaos, no wind rush with that missile hole!.",
    "comment#231": "🎉🎉🎉🎉🎉🎉🎉🎉",
    "comment#232": "What a fantast. All those planes firing at them a nd still up. Pilot such good actor.  Cant believe hes not a pilot.",
    "comment#233": "Superbe film merci",
    "comment#234": "How do you get rid of the captions, very annoying?",
    "comment#235": "If was safe coming to a certain point why not turn back",
    "comment#236": "Love this movie❤❤❤❤❤❤🇧🇼🇧🇼🇧🇼🇧🇼🇧🇼",
    "comment#237": "Best movie I have watched!! Kudos!!",
    "comment#238": "The comments section is SUSPECT AF.... but I&#39;ll watch this anyway.",
    "comment#239": "Good movie 👍👍👍👍<br><br>Out of 5 lol",
    "comment#240": "I figured out that surprise at the end about ten minutes before ..",
    "comment#241": "jjj",
    "comment#242": "Yeah nobody is talking about the two people sucked out the plane.",
    "comment#243": "Ang ganda ng movie na to😌🥹",
    "comment#244": "Spoiler alert ‼️ I knew that old man was Nigel!",
    "comment#245": "Great movie, really loved it!!",
    "comment#246": "In 1940, Germans didn&#39;t have jet planes - it was early 1945. all movie is fake, unfortunately...",
    "comment#247": "🔥✊🏾Daaamn!!!…What An ENDING!!…Nigal Is THA MAN!!…BadAss Ending!!!…👊🏾💯",
    "comment#248": "Wah! I like it.tende",
    "comment#249": "❤❤",
    "comment#250": "Every comment is telling me to watch... Let me go for it...",
    "comment#251": "Aim eeh I see all cleared c...ils.....n",
    "comment#252": "It reminds me of &quot;Manifest&quot;",
    "comment#253": "Super love this movie.  Thank you for sharing this video",
    "comment#254": "I think I missed something, what was all that about ( white beard guy at the end talking to the captain) ??",
    "comment#255": "I  can&#39;t beleaved  end  of  the  movie  but  how  was  it  happend  is  it  possible😢<br>Naigal helped  them  still  i am  cringinged and  shocked  end  of the  movie  😢😢",
    "comment#256": "Right seat needs a haircut.",
    "comment#257": "Govnar American end Germany",
    "comment#258": "The Nigel twist was a very clever one. Will have to watch it the second time to examine the plots more thoroughly.",
    "comment#259": "This movie is excellent ⭐️⭐️⭐️⭐️⭐️ It has an interesting plot, great acting and suspense and a nice twist at the end 👍🏻 love it ❤",
    "comment#260": "nice loved it thanks for uploading this in youtube because the only thing i can use on my data package is youtube.",
    "comment#261": "This film is well worth watching. I will not say what happens but suffice to say its well worth watching. PC. 15. 10. 2023.",
    "comment#262": "❤",
    "comment#263": "Amazing❤",
    "comment#264": "I need another one like this it’s beautiful not boring to watch can anyone suggest a movie more or like this one",
    "comment#265": "Rip two passengers that flew out for example born1985 - died1940 how that even make sense lol",
    "comment#266": "What an interesting movie I ever seen... so great and top notch from beginning to  end.. must watch.. YouTube recommended today 15.10.2023... such 2onderful movie..<br>Today is Sunday i planning to watch some movie in theatre .. but when I watched this now inthroughly enjoyed❤",
    "comment#267": "Captain always contacted to nigel in the radio, to do some thing duting world war 2..but in the end of movie, nigel was in the same flight of current time  with the smae captain...amazing twist movie...",
    "comment#268": "well that was different. very entertaining...thanks for posting..",
    "comment#269": "Very good movie, I thoroughly enjoyed it and highly recommend it for everyone to watch. The captain is awesome. Luv this 😍",
    "comment#270": "With Jimmy Falon as your co-pilot!  Lol, looks a lot like him",
    "comment#271": "Great movie. I watched the ending 3 times to make sure I got every detail.",
    "comment#272": "Muy INTERESANTE PELÍCULA 🎥😊. 👏👏👏❤ ME GUSTO MUCHÍSIMO 😍🥰",
    "comment#273": "the amazing thing is that man who never removed his headphones",
    "comment#274": "Love this movie.  There isn&#39;t a boring moment.  On the edge the whole time.",
    "comment#275": "I LOVE THIS MOVIE . THE CAPTAIN ALWAYS MINDSET TO &quot; CALM DOWN &quot; WHATEVER THE SITYATIONS IS . UNTIL THEY GO HOME SAFE AND SOUND . HIS LEADERSHIP AS A CAPTAIN GIVE THE ROLE TO EACH ONE  INDIVIDUAL ON THAT PLANE . GOOD LEADER GOOD FOLLOWER ....WE NEED ALL KIND OF LEADERSHIP LIKE HIM . HIS NOT ONLY A GOOD CAPTAIN . BUT HIS A GOOD LEADER AS WELL .",
    "comment#276": "I really enjoyed this movie lol 👍🏻",
    "comment#277": "Now, I need more movies like THIS!!!!💯✈🔥",
    "comment#278": "❤❤❤❤❤",
    "comment#279": "Fresh storyline",
    "comment#280": "Ohhh miGOD I HAD TA STOP THA MOVIE 13: MIN IN ITS SOO SCARY😢😮 THIS MOVIES GOOD ALREADY. I LIKE THAT ACTION",
    "comment#281": "Honestly I so much love this movie 🎥❤❤❤",
    "comment#282": "They survived, because they had radar, and modern planes have faster engines(about 100km faster), can fly higher, and are nimble for it&#39;s size.<br>Movie is great.",
    "comment#283": "Omg time travel I like, Nigel is in the plane😅🥰",
    "comment#284": "No wonder the jerrys lost the war , those pilots couldn&#39;t hit a bulls arse with a double base.   . A plane that size and they couldn&#39;t shoot it diwn",
    "comment#285": "🇬🇧 Loved this! Thank you 😊",
    "comment#286": "The 2 passengers with the pilots are really useful! I think the man wearing eye glasses is Filipino",
    "comment#287": "this is historic and terific, i love this. captain, you should be a real captain.",
    "comment#288": "Being a filmlover for over 50 years i have to give this a 9/10 I have never laughed or giggled as much since watching a monty python film or the bonzo dog doo dah band.10/10 for sillieness  10/10 for silly acting  10/10 for silly script  and 10/10 for a film being so dam silly that you watch it to the end.",
    "comment#289": "Awww I really enjoyed this movie soo powerful but Theresa too is a brave woman",
    "comment#290": "Nigel is such a gentleman❤❤❤",
    "comment#291": "AFTER A LONG TIME, A GOOD MOVIE TO WATCH 💯💯💯👌👌👌👌👌",
    "comment#292": "Very interesting a must watch<br>Very iconic👍🇮🇳",
    "comment#293": "just me or does anyone else think the copilot looks vaguely like Jimmy Fallon",
    "comment#294": "Why no one is talking about the two people who have blown out",
    "comment#295": "I liked the movie but doesn&#39;t one off the pilots look like Jimmy Fallon hi hi",
    "comment#296": "Big up to captains they try their best to make sure everything is okey ❤❤",
    "comment#297": "Great movie❤",
    "comment#298": "Ternyata mereka takut semua jg sama Adolf Hitler 😂😂😂",
    "comment#299": "It needed some gratuitous topless scenes.",
    "comment#300": "&quot;Safe and sound...&quot;  Well, except for the pair of ejectees who are probably still screeching over France.",
    "comment#301": "Woaah goosebumps ending..",
    "comment#302": "waw it&#39;s amazing movie",
    "comment#303": "Loved the tension",
    "comment#304": "WHY IS NO BODY TALKING ABT WHY THE THD OLD NIGEL NOT TALKING ABT HIS PAST",
    "comment#305": "What a nice . Movie. <br>😢🎉",
    "comment#306": "What a nice . Movie. <br>😢🎉",
    "comment#307": "Special effects are pretty good for a low-budget indie film.  Not sure when this movie was made but could be a prediction to a future war (right now is 14/10/23 @ 0940)... with Russia at war and actual Nazis being in the news lately... is this movie more science fiction or science foretold future fact?  ...and the twist ending, well done.  Never seen it coming.",
    "comment#308": "So, the Old man was Nigel Himself, the Guardian Angel..",
    "comment#309": "The imagination, though quite brilliant, failed to impress me while I&#39;m watching the movie - until the old man turned out to be Nigel!",
    "comment#310": "What a movie, very interesting, I couldn&#39;t expect that last scene of nigil 🎉",
    "comment#311": "The pilot feeling bright..its war use your commonsense",
    "comment#312": "Black hole...",
    "comment#313": "Anyway, thiss just a movie",
    "comment#314": "Plane usually has to be raised above the cloud to avoid the storm. SOP",
    "comment#315": "Should have raised the plane higher above the cloud!",
    "comment#316": "Goosebumps  at -<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=51m36s\">51:36</a>😮😮😮🤯🤯🤯",
    "comment#317": "what happened to a woman who fell of the plane??",
    "comment#318": "I wanna travel through the past and future",
    "comment#319": "Very good movie. Well done. Keeps you involved the whole time.",
    "comment#320": "What happened to the two people that flew out of the plane? This is like a conspiracy theory....",
    "comment#321": "What a great movie and I was wondering if they would some how meet Nigel in their time...thanks so much for the upload",
    "comment#322": "wHAT A great movie that keeps you at the edge of your seat.....i&#39;ll remember this everytime i fly......",
    "comment#323": "“Not now, Nigel. Getting shot at” 😂",
    "comment#324": "Great movie,,really cool about the history  part",
    "comment#325": "Great movie!",
    "comment#326": "Good movie.",
    "comment#327": "This movie is so interesting I really enjoyed it.<br>It is good to have in God. The captain is a man of faith",
    "comment#328": "Masterpiece💫💫💫👏👏👏",
    "comment#329": "I have never paced the floor while watching a movie until This masterpiece! 10/10",
    "comment#330": "The ending was literally mwah!...",
    "comment#331": "I enjoy this movie so much I love the pilot He tried his best both of them tried their best ❤ Save landing",
    "comment#332": "Awesome Movie. Acting very good. Cheers",
    "comment#333": "Very beautiful, thanks!🙏🏻👏🏻🌹",
    "comment#334": "Great movie, this is indeed a master piece",
    "comment#335": "Well done 👏",
    "comment#336": "Oh mine! I was scared for Hector. I think he&#39;s a strong believer of God. His faith safed him. Great movie",
    "comment#337": "So good movie,, nigel is alive at the last",
    "comment#338": "that wz great",
    "comment#339": "Best movie🎦😊 ilove it and I enjoy it",
    "comment#340": "Ni😊gel. Wow wow wow wow wow wow wow",
    "comment#341": "Nice movie 🍿🍿🍿🍿🍿",
    "comment#342": "i really love the movieeee!!!!!!!!!!!!!!!!!",
    "comment#343": "Dari indonesia hadir<br>✈♥♥♥",
    "comment#344": "It&#39;s very nice Film ever since they back in past during the time of Adolf Hitler",
    "comment#345": "The NTSB is going to have something to say about that plane...",
    "comment#346": "Propaganda Film",
    "comment#347": "1 thing if its 1940 why are there me-262s",
    "comment#348": "Enjoyed every second of the movie, must watch.🤩😀",
    "comment#349": "Wow great movie goosebumps 😁🙂",
    "comment#350": "Very good movie. Nigel was great. What an ending !!!!!!!!!  The pilot strong is handsome.I",
    "comment#351": "The story about plane going travel time is great, but the actor &amp; movie is low level. It should handle by warner bros like wonder women movie.<br><br>The last part is epic👍",
    "comment#352": "The captain is an ediot😅😅😅😅😅😅😅😅😅😅the only ediot on the pkain😊😊😅😅",
    "comment#353": "Awesome movie love it!!!",
    "comment#354": "This movie is crazy, they chastised the passenger for wanting to kill Hitler thereby altering the time line, yet they gave the allies 21st century tech to help them win the war also people who were born in future died in the past,  and no one even acknowledged that, they just walk off a plane that lands with a large hole in the side and its all good, WTH?",
    "comment#355": "Omg omg. I just finished watching this movie. I read about a 100 comments. Before watching it. What a terrific fabulous movie. Omg. I&#39;m speechless. The whole cast did such a terrific job. The special effects was the bomb... Lol figure of speech guys. The captain was dynamite. I wish he truly was a pilot. I&#39;m gonna watch this again. All I can say is if you come across this movie you better watch it. My nerves are trying to calm down. Thank you YouTube for letting us watch this. Who would ever believe time change. Wow 😮😮😮😮😮",
    "comment#356": "Debería ser subtitulada en español, más que mal es la segunda lengua más hablada del mundo 😢",
    "comment#357": "Wow, excellent movie!! Lots of tension. Really well done by all actors, actresses. Fully enjoyed!",
    "comment#358": "second time watching, better than the first time",
    "comment#359": "What&#39;s the name of the co-pilot",
    "comment#360": "Wow!👌",
    "comment#361": "I.ll  have some of what the makers of this were smoking..",
    "comment#362": "Captain you&#39;re the best ❤❤❤",
    "comment#363": "Same Captain &quot; Faran Tahir&quot; got sacked in Star Trek. On the day of Kirk&#39;s birth...",
    "comment#364": "Excellent movie!!!!!!!",
    "comment#365": "I enjoyed the movie every thing was 😘😘😘😘",
    "comment#366": "Well that was a damn good movie thanx for upload",
    "comment#367": "That&#39;s the only passenger aircraft that has an aisle wide enough for people to pass each other, never seen that even on a Jumbo 747. If it was Ryanair they would fit two more seats on each row.",
    "comment#368": "Nice Movie❤",
    "comment#369": "Awaken my senses 😂<br>Damn nice movie<br>Thank you UTUBE 💚",
    "comment#370": "TOTOO BA TALAGA yong Time travel . Grabi galing nang director nito from Present back to 1940&#39;s 😮😮😮",
    "comment#371": "Nice movie",
    "comment#372": "wonderful  movie, thanks every one for it",
    "comment#373": "Now i can&#39;t sleep😅..12 at night and wide awake..😮",
    "comment#374": "Great  movie 🎦",
    "comment#375": "bumalik sila sa nakaraan panahon ng world war 2 1940",
    "comment#376": "The old guy was Nigel&#39;s son, right?",
    "comment#377": "Ooh wow better than James bond movie and other new action movies.bravo",
    "comment#378": "Wonderful movie 🍿🍿",
    "comment#379": "My God! Was so nervous the entire flight🫣😬,then very emotional how it ends …WITH NIGEL!!!!!😭 Fantastic movie for me.🥰Thanks for sharing this.😍",
    "comment#380": "Niegal twist is mind-blowing  fantastic movie.",
    "comment#381": "Nice movie",
    "comment#382": "Hey if u watched the whole movie plz like to me and I will send u a cookie in the comments!!❤<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>Hey plz like or I’ll ban u cuz the channel is my friend<br><br><br><br><br>Btw the two passengers got sucked out for the flight is pretty funny ngl well it’s not real",
    "comment#383": "good movie❤❤❤  thank you, almost make me heart attack",
    "comment#384": "This story like merepek meraban. Makan merepek dekat jamban",
    "comment#385": "There&#39;s a plot twist at the end of the movie",
    "comment#386": "lastlayy...nigel appear..thank this movie",
    "comment#387": "Good but feel sorry for the dead passesngers",
    "comment#388": "Wow. This was a great movie!",
    "comment#389": "Nigel is incredible 👏",
    "comment#390": "That’s was so traumatic flight thanks for sharing this video",
    "comment#391": "Excellent Film, and for free!",
    "comment#392": "awesome. i have a crush on the captain. lol",
    "comment#393": "Man hecktor sacrificing himself to eave flight 914 😔",
    "comment#394": "Bravo to those two soldiers 👏",
    "comment#395": "I SEE THAT YOU TOOK MY COMMENT OUT BECAUSE OF MY DIFFERENCE OF OPINION.  SIRS I AM A CHRISTIAN AND USED NO BAD LANGUAGE NOR DID I INTEND TO OFFEND ANYONE BY HOW I SAW THIS MOVIE.",
    "comment#396": "The captain to listen to those two wise men",
    "comment#397": "Awesome movie",
    "comment#398": "U.S. Armed forces only fly in civilian clothing when on an overseas flight. This showed a couple of Army soldiers in BDU&#39;s.",
    "comment#399": "All that just to return back to the future lol 😂",
    "comment#400": "Fabulous!  I&#39;ve really enjoyed this movie ... there&#39;s just a few minutes left to run and I haven&#39;t paused for anything.  Thank you. I used to have a &#39;T&#39;-shirt in the 1970s that said I flew through the Bermuda Triangle and I survived, which was a fact, due to me having served, in a military capacity, in 1977.",
    "comment#401": "That was one sturdy plane to make maneuvers like that lol. No oxygen masks deployed when there&#39;s a gaping hole in the side of the plane.  It was a good movie though.",
    "comment#402": "Thank You for the upload. I really enjoyed the movie. 👍👍",
    "comment#403": "Thought nigel was an asshole who was helping the enemies, realized it later that he was a saviour",
    "comment#404": "This has to be one of the most amazing movies suggested by YouTube. <br><br>I love the twist at the end part. <br><br>I wish Strong had a conversation with Nigel",
    "comment#405": "This movies was crazy but had me on the edge of my seat all the way, the acrobatics of that plan were wildddddd.🥰. Ladies and gentlemen. it&#39;s about to get bumpy again 🤣🤣🤣. And I love a creepy ending!!!",
    "comment#406": "Really,  nice  movie  l  enjoyed it very  much  give  l,d  give a  9  out of  10",
    "comment#407": "Great movie ever",
    "comment#408": "What a great movie 🍿 I enjoyed it soooo sooo much and I cried a little bit at the end 😢",
    "comment#409": "Pretty decent watch. Thank you Primetime :)",
    "comment#410": "Terjebak didlm ruang dan waktu,  untung bisa keluar...",
    "comment#411": "The plot twist in the end is just perfect",
    "comment#412": "Very nice movie I love it",
    "comment#413": "Great Movie",
    "comment#414": "👍👍👍",
    "comment#415": "Very nice movie..The pilot was really good  to handle like a fighter pilot in the bottle of war😊niegel the angle to land",
    "comment#416": "A brilliant film. Well done to everyone involved ! <br>Thank you for the upload. Bless you ! 🙏",
    "comment#417": "Great movie.  Had my stomach in knots!!  Surprise ending.",
    "comment#418": "utter garbage! terrible script",
    "comment#419": "❤❤❤",
    "comment#420": "Very interesting movies and educate lesson from it.",
    "comment#421": "Well done!!! Was hoping though when the pilot exited the plane that  Nigel Sheffield, now in his 90&#39;s,  would have been waiting for him in the terminal instead of on the plane and that it would be a meeting of acknowledgement.",
    "comment#422": "Excellent ending and what a surprise",
    "comment#423": "Swearing at Jesus!!!!! Hell is waiting for you.",
    "comment#424": "Good movie i like this movie",
    "comment#425": "This is really Wonderful movie",
    "comment#426": "Congratulations.. Captain you care all passenger.💖💖💖I like it this movie...💖💖💖",
    "comment#427": "That looks like a ME262 German jet fighter on the port side of our airliner.  These were not flying this early in the war, especially over England.",
    "comment#428": "i love this movie",
    "comment#429": "Nice one",
    "comment#430": "I feel their fear men<br>Sorry we lost two<br>It&#39;s a great movie",
    "comment#431": "This is a great movie",
    "comment#432": "This movie was better than I thought it would be!",
    "comment#433": "Accidentally found this.  Riveting!",
    "comment#434": "😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅",
    "comment#435": "was that old man at last whom captain talked to was nigel himself...🤔😬😁😅😄😅",
    "comment#436": "Great movie",
    "comment#437": "This movie is amazing",
    "comment#438": "Good movie 2x watching this.",
    "comment#439": "poor two souls got sucked out of plane",
    "comment#440": "Nice movie flick , watch it only if you got an hour or so to spare. The ending...",
    "comment#441": "Thank you for watching by the way this movie true story?",
    "comment#442": "Oh Crikey!<br>Its only half way through &amp; im jumping about in my seat, biting my nails &amp; im like a cat on hot bricks!<br><br>THIS IS JUST SO EXCITING &amp;<br>NERVE WRACKING!!!<br><br>I can hardly wait to see what happens but dont want it to finish too soon!<br>Its VERY good &amp; worth every moment of watching!<br><br>I know it will turn out ok but shit<br>Its making me so nervous!<br>This is AMAZING...<br>Peace<br>🇬🇧👧",
    "comment#443": "This movie deserves 8million views compared to flight666😊",
    "comment#444": "Surprisingly good movie; well-written, well acted, well directed, and well filmed. Thanks for the upload!  &gt;^*^&lt;",
    "comment#445": "I love it. Great movies. <br>Watch it...I mean it.<br><br>❤❤❤",
    "comment#446": "Who played the good looking flight attendant  ?",
    "comment#447": "Good looking flight attendant 😍",
    "comment#448": "This is one of the best plane movie that i watch,i feel all their fears &amp; confused about what&#39;s happening outside the plane,i feel like i was also riding on the plane,specially as a daughter of a soldier,it brought back all my scary memories when the enemies started to fire the flight 42,those gun shots &amp; bombs where so scary to death..my god....thank u for posting this movie to YouTube,10⭐/10 rate for this movie😊,i hope u posting more movies like this that anyone can relate,thank u &amp; god bless❤️❤️❤️",
    "comment#449": "Dont know why they didn&#39;t climb when being  attacked ? 1940&#39;s plane couldn&#39;t have climbed as high.",
    "comment#450": "very enjoyable movie",
    "comment#451": "As much as this is a fantastic movie 🎬 <br>Great acting and a couple of pretty airstudesses.<br>The simple fact is that like Theresa in the movie did say that time travel is impossible <br>Also that aircraft with its gaping hole would have crashed way before it landed probably killing everyone on the plane <br>The ending was a bit confusing as well <br>The plane landed in Germany yet they were flying over France <br>Still everything is possible in the movies even though in actual reality some things are not possible <br>Still a brilliant movie and better than some of the so-called blockbuster movies",
    "comment#452": "Great movie. Certainly not a waist of time. 😊",
    "comment#453": "Good movieeeeee🎉🎉🥹",
    "comment#454": "Love this movie ❤❤",
    "comment#455": "Those boys flying the 262&#39;s need to go back to the shooting range.",
    "comment#456": "I want that actor-pilot to become a real pilot and be on every flight I take from now on. 😂",
    "comment#457": "Hes nigel🫣😄",
    "comment#458": "❤❤❤❤",
    "comment#459": "ONE OF THE BEST MOVIE. 😊",
    "comment#460": "I believe this movie has got something to do link with MH370 missing Malaysian Airlines",
    "comment#461": "Original and great film!",
    "comment#462": "This movie reminds me of stephan kings the langoliers movie",
    "comment#463": "Good story, good plot, and good ending 👍 Bravo!",
    "comment#464": "❤❤",
    "comment#465": "Nice movie...good job captain...good job everyone",
    "comment#466": "the last person old man..... is NIGEL.... ❤️❤️❤️❤️",
    "comment#467": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=1m04s\">1:04</a>min still watching, goosebumps and butterflies 💀💀💀💀,I hope by the time I finish watching no one will be dead🥺🥺",
    "comment#468": "gosh i just love this as always that i always come back",
    "comment#469": "タイムトラベルは　存在しない",
    "comment#470": "Omg i loved it. What a beautiful movie Thank You",
    "comment#471": "Wow",
    "comment#472": "Great movie!  Loved it!  This is the 2nd time I have seen it.",
    "comment#473": "glad that youtube recommend this film to me as I was browsing which movie to watch, no regrets clicking the play button. GOOD MOVIE, goosebumps ending 👏🎬",
    "comment#474": "Actually was very very good and that niegel twist at the end is superb truly 🎉",
    "comment#475": "Never thought this story would turn amazingly worth watching for..Thanks for uploading this and sharing this great 🎥 movie with us Admin.. We&#39;re looking for another great story next.. ☺️🙏",
    "comment#476": "Great captain",
    "comment#477": "Near the end Nigel says flight 42, then IA42 is the name said by the modern air traffic control<br><br>I love this film",
    "comment#478": "jimmy fallon on the board",
    "comment#479": "😂I never knew this story until I heard from Vybz radio",
    "comment#480": "Wow.. what a movie🥰 i lv it",
    "comment#481": "Just imagine this same scenario with new day karens and others...<br> Wonderful movie.. loved it! Felt like I&#39;m there myself!<br>Edit: wow.. that ending with nigel! Need a part 2 ofcourse!",
    "comment#482": "I love this movie",
    "comment#483": "My Disappointment is, those Soldiers who are supposed be the most useful in such situation, are doing nothing!",
    "comment#484": "Great movie. 👍",
    "comment#485": "work under pressure (Be like Pilot) <br>Helping deeds returned you <br>(Nigel)  - Nigel and pilot works equal there🎉",
    "comment#486": "It was not safe. Where is your traveler who fell on the ground?😂",
    "comment#487": "Russia is a very good country. From Netherland ❤❤",
    "comment#488": "BEST MOVIE EVER,,, THRILLED MY SPINE. I WILL NEVER WATCH IT AGAIN AT NIGHT. CANT GO TO MY ROOM TO SLEEEP",
    "comment#489": "I loved this movie<br>It is one of the best movies I’ve ever watched <br>I love Germany<br>This Germany<br>Nigel <br>…",
    "comment#490": "I love this movie and here i appreciate  the pass over methode of the first pilot thanks.",
    "comment#491": "End was just 🔥🔥",
    "comment#492": "1949-2023....av Loved it",
    "comment#493": "The plot twist at the end omg 😮❤️❤️i didnt expect that!😮❤️👏 this is one of the best movie I&#39;ve watched!👏there&#39;s no dull moment or scenes,every scenes was intense and full of suspense even from the start until the end of this movie 👏👏",
    "comment#494": "This movie was old but i love it❤️the storyline,the casts,and the  way they connect the science and history is 👏its 10/10 for me👏❤️its better than the other movies nowadays.",
    "comment#495": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=48m41s\">48:41</a>",
    "comment#496": "That guy listening to the music😂",
    "comment#497": "What a fantastic Time travel movie.",
    "comment#498": "Wow great 👍👍👍",
    "comment#499": "Such a nice movie",
    "comment#500": "Love this movie to the max. Never a dull moment and lots of bravery on display.  Rating.. 81/2 out of 10.",
    "comment#501": "Appreciate the sound quality..",
    "comment#502": "superb movie😘🥰😍",
    "comment#503": "THAT&#39;S GREAT! MOVIE REALLY WELL DONE, I ENJOYED IT A LOT",
    "comment#504": "I saw this film a while back. Been on yt forever.",
    "comment#505": "A interesting movie! Adventurous one. Good end. \r<br>\r<br>I am giving 4.5.",
    "comment#506": "Love the story. Wish there was a better follow up ending",
    "comment#507": "Love this film👍👍👍👍♥️♥️♥️♥️<br>Rating 10/10",
    "comment#508": "Nice movie but too much fiction;<br>Aeroplane missing all bullets from jets<br>Aeroplane making manouver like modern f-22 raptor<br>Opening the landing gear in mid air and someone hanging on it.<br>Opening the passenger door mid Air and aeroplane still maintain stability<br>First officer being shot at but still healthy 😂😂😂😂",
    "comment#509": "i got goosebumps in the end, nice movie😊",
    "comment#510": "Radar on the ground ? Hmm",
    "comment#511": "great movie, watch it👍",
    "comment#512": "Great movie",
    "comment#513": "I want to study English so l shout watch this movie",
    "comment#514": "Filmao Recomendo",
    "comment#515": "Funny movie, m pretty sure the director never consulted a pilot before making the film or else he would have kown about rapid decompression.",
    "comment#516": "Super film",
    "comment#517": "Very satisfied movie ❤",
    "comment#518": "<a href=\"https://www.youtube.com/watch?v=KbjSuMyTjG4&amp;t=34m41s\">34:41</a>",
    "comment#519": "I guess the rules of not altering the past would still apply even in an alternate past,  damn Time travel would have so maybe potential mistakes we couldn&#39;t even think of no matter how safe we tried to be.",
    "comment#520": "Excellent story I imagine things look this have happened,  it&#39;s based on a true story but theirs also the plane that arrived with every passenger as a skeleton 💀,  if this is based on that I&#39;ll edit this because it watched a few things lately about airplanes going missing 30 years and turning up in the wrong place so Iay be conflicted but theirs some insane stuff that can&#39;t be explained away theirs stuff that has happened we&#39;ve only theorised on.",
    "comment#521": "this has been the best movie i&#39;ve have seen before. 1000/10 stars, so amazing❤",
    "comment#522": "Wow great movie ❤",
    "comment#523": "No one be strong like Ailot",
    "comment#524": "The last part is the best❤❤❤",
    "comment#525": "Great Movie... Worth watching",
    "comment#526": "realy wonderful and so exited 🥰",
    "comment#527": "Nice movie",
    "comment#528": "Like mh17 😢",
    "comment#529": "Amazing",
    "comment#530": "This movie is literally the best😍",
    "comment#531": "😮",
    "comment#532": "floght to heaven",
    "comment#533": "What about the 2 persons who have died 😢😢",
    "comment#534": "would radar frequencies communicate in 1940s with current equipments?",
    "comment#535": "What a movie",
    "comment#536": "I thought I have seen this movie sometime in the past😅....but truly,  I hadn&#39;t realized the suspense and thriller this movie got.<br>The end part was Amazing 🤩!  Nigel has turned into an old guy now, travelling onboard.  What a movie 🎥",
    "comment#537": "The movie is just fantastic ..",
    "comment#538": "Awesome movie and very entertaining. Loved the little twist at the end ❤❤",
    "comment#539": "This movie has a great twist and is incredibly undervalued.",
    "comment#540": "But when they are traveling in time they are already dead,,",
    "comment#541": "loved the story",
    "comment#542": "I&#39;ve never seen this goosebump twist movie.. 9 out of 10😊",
    "comment#543": "<a href=\"https://bloglifevista.blogspot.com/2023/08/divulging-setup-gathering-indias.html\">https://bloglifevista.blogspot.com/2023/08/divulging-setup-gathering-indias.html</a>",
    "comment#544": "Good thing to found this movie.",
    "comment#545": "just awesome movie man!",
    "comment#546": "Was the old man the young Nigel from 1940😮",
    "comment#547": "Very good movie.impresive",
    "comment#548": "Is that old man is nigel",
    "comment#549": "Nice one.Salute for the main character.Anyway peace is 1000 times better than war😢❤",
    "comment#550": "🫡🫡🫡",
    "comment#551": "Its one of the best intersting movie i hv ever seen...the last seen was mind-blowing",
    "comment#552": "No one can be strong like a pilot ❤🎉",
    "comment#553": "love this movie and the captain and all crews",
    "comment#554": "Nice movie ❤",
    "comment#555": "Loved this movie and the ending, Nigel!  Wooaahh.",
    "comment#556": "❤❤❤ fantastic ❤❤❤",
    "comment#557": "That is very good.They went to the 1940 Nazi-Germany.İt is insane.He Said This Germany in the end<br>(Abschließend sagte er, es sei Deutschland.)😂This movie is very good.l subscribe your channel.",
    "comment#558": "Awesome movie..and the end was unpredictable",
    "comment#559": "Beautiful movie. Nigel was on the plane in the end😂",
    "comment#560": "Loved it!",
    "comment#561": "Anything is possible 😊",
    "comment#562": "i love the airhostess what a sexy look",
    "comment#563": "One of the most stupid movie I´ve ever seen before, in all aspects.",
    "comment#564": "My kind of movie, 💯movie, thank you for sharing😊😊💫💫",
    "comment#565": "Really nice🙏🏼❤️‍🩹",
    "comment#566": "Very underrated movie. Such a good job to the uploader🎉🎉🎉👍👍👍👍👍👍👍👍👍👍👍👍",
    "comment#567": "Whats w the ladies talking sound effect at start of the disaster??",
    "comment#568": "Omg! This film is so underrated!! Never a boring moment and nice twist!!❤❤",
    "comment#569": "The mvie was fire and its underrated . The pilot is a good actor but the co pilot is not. The twist at the end was not a surprise if you watch lots if time involved movies. I thought it was obvious",
    "comment#570": "I like english movies but this movie is so amazing in my experience 🎉",
    "comment#571": "Nicee movie❤❤❤🇧🇩🇧🇩",
    "comment#572": "Still i don&#39;t get at the end of twist from old can you one tell me it clearly",
    "comment#573": "Really nice and scaring movie ❤😮❤",
    "comment#574": "Very good content and very good movie I love it ❤",
    "comment#575": "Famtastic",
    "comment#576": "Amazing 1,000,000,000 out of 10",
    "comment#577": "A masterpiece",
    "comment#578": "I loved this movie....",
    "comment#579": "Cool movie",
    "comment#580": "It&#39;s hard to explain my emotion but it&#39;s indeed a very nice movie.",
    "comment#581": "One of the best and underrated movie ever ❤",
    "comment#582": "Best movie ❤️",
    "comment#583": "I love the movie from south india",
    "comment#584": "This movie has entertained a lot better than other boring movies i have seen in past",
    "comment#585": "Caption is Pakistani and in reality Pakistani pilots considered to be great pilots emirates airline has dry Pakistani international airline PIU, even Pakistan, international least two planes, emirates",
    "comment#586": "Nice movie ist time seen hollywood movie",
    "comment#587": "Nice movie🤩👍love it😍",
    "comment#588": "I love this movie❤",
    "comment#589": "Basta Ang masasabi ko Ang Ganda ❤😊",
    "comment#590": "I..",
    "comment#591": "Wow what a good movie!! ❤ spectacular ❤ 10/10",
    "comment#592": "One of the best movies I&#39;ve seen in a very long time, thumbs up 👍",
    "comment#593": "Great movie ❤",
    "comment#594": "10/10",
    "comment#595": "The Contradiction is that in a huge flight only a few passengers and passenger area is shown. But overall it&#39;s a good movie.❤",
    "comment#596": "Climax twist 👌🏻👍🏻",
    "comment#597": "I didn’t notice that I just finished my one hour walk in the treadmill….awesome movie give me goosebumps!!!!",
    "comment#598": "Best flight movie",
    "comment#599": "Excellent Movie... Loved the Twist at the End... Well worth the Watch.. Thank You for Uploading..",
    "comment#600": "Nice movie😮❤ captain",
    "comment#601": "😂😂😂 Вы видели в конце фильма, наша русская  СКОРАЯ ПОМОЩЬ 03!!!!😆🔥",
    "comment#602": "Hactor was real hero in  this movie and captain. Really fantastic movie but full movie time I was afraid.",
    "comment#603": "Nigel is one of the passangers..",
    "comment#604": "So the pilots are having problems with their instrumentations, what is the next course? Land as soon as possible.",
    "comment#605": "Good movie",
    "comment#606": "Nice..from kerala ❤",
    "comment#607": "Mind blowing 😢  it is dangerous and risky.....",
    "comment#608": "Enjoy the movie thanks for sharing",
    "comment#609": "Its was real movie",
    "comment#610": "Cute 3nding😂😅 !!!",
    "comment#611": "Love the guy who was Captain!!!",
    "comment#612": "Great movie. The captain was best. He should be in more movies.",
    "comment#613": "The Captain has a great look and a really nice voice 💕 Worth your time to watch.",
    "comment#614": "That&#39;s a flaw in the storyline at the ending but other than that, entertaining sci-fi 💕",
    "comment#615": "Great movie 💽❤️❤️",
    "comment#616": "I think the the old man was Nigel. But hw was he in the presence. Anyway just a fiction. Something like that can&#39;t exist",
    "comment#617": "The real suffer was Daneil he literally got SHOT",
    "comment#618": "I&#39;m the real hero!!  I watched this movie twice this week.",
    "comment#619": "nice movie fr:philippines",
    "comment#620": "It&#39;s a plane and doesn&#39;t have ANY parachutes? They have to scrounge to make one?",
    "comment#621": "Good Show old chap! I&#39;ve seen this before, but didn&#39;t remember how it went. Nice job of flying by a former Star Ship Captain, and this time the Romulans didn&#39;t kill him right off!",
    "comment#622": "Farah Tahir is Amazing, big fan of him",
    "comment#623": "Worth watching !",
    "comment#624": "Nigel is a real hero 💕🕶️🤏and this is a nace move and is my favourite one 😁🔥",
    "comment#625": "In the first one it&#39;s dark and I thought they were in space",
    "comment#626": "Gentleman with headphones like ,this flight is taking forever 😅. )",
    "comment#627": "The perfect  movie l like  the last  sence of  song",
    "comment#628": "I never watched such a wonderful and interesting movie which kept me at the edge of my seat from the beginning till the end. Kudos",
    "comment#629": "Hector is wow hero..     😅",
    "comment#630": "nigel boarded in that flight to see if he saved the flight who saved them during his younger life and he did 😊  he is so lucky to experience 2 different time lines at the same time",
    "comment#631": "Can someone explain to me the ending? I don&#39;t understand what happened or the significance of that old man being Nigel Sheffield II. I know that Nigel was the person who helped them, but I don&#39;t really get the &quot;twist.&quot; Thanks to anyone who can explain.",
    "comment#632": "I loved this movie thanks all i felt as there 🙂😇😇",
    "comment#633": "noice!!😍😍",
    "comment#634": "Captain Strong was the same terrorist in the first IRONMAN movie 👌",
    "comment#635": "I&#39;m glad there safe In the plain. God bless you 🙏🥺🙏🥺😇❤❤😊😊🎉🎉😅😅",
    "comment#636": "Perfect movie 👍👍👍💚",
    "comment#637": "Wow really amazing this movie I really enjoy it last final twist that&#39;s old man is nigel 😮😮",
    "comment#638": "What a goose bumping end was it? Love it &lt;33",
    "comment#639": "❤❤❤",
    "comment#640": "Nigel be Like, cod help me",
    "comment#641": "Nigel played a key role😂 but hector is the real hero if he don&#39;t to dare to fix then if they find the place to land their is no any use❤......",
    "comment#642": "A very good movie 👍",
    "comment#643": "I am from Bangladesh 🇧🇩 ☺️ 😌 🙂 😎 😊 🇧🇩 ☺️ 😌 🙂 😎 😊 🇧🇩",
    "comment#644": "It&#39;s really nice movie 👍",
    "comment#645": "Great movie  thanks for sharing 👍",
    "comment#646": "excellent movie",
    "comment#647": "Wow I loved this movie keep you in suspense the ending tho Nigel was on the plane that entire time",
    "comment#648": "It was really exciting 😮😮 I wish the plain would land on 1940 airport hhhhhhh",
    "comment#649": "This movie seems real😮&quot; nice one.",
    "comment#650": "and nobody is talking about the 2 passengers that where sucked out of the plane🙁",
    "comment#651": "Definitely recommend watching this",
    "comment#652": "Brilliant",
    "comment#653": "fantastic movie i have watched just now....... From India🕉🕉🕉🙏🙏🙏",
    "comment#654": "A very very nice movie.i really enjoyed it.😅😊😊😊😊",
    "comment#655": "Very Interesting Film<br>Its help me a lot for learning english <br>My main reason to see this film is , for learning english",
    "comment#656": "Thank you: it&#39;s a strong script, but, if on board it is 2000, and outside- 1940, how could one be lost out of the plane in 1940, if she was from 2000? She could not be sucked out by the past, as she was in the future!",
    "comment#657": "Excellent movie❤❤",
    "comment#658": "Thoroughly enjoyed this movie. The twist in the end made it that much better. Thanks for sharing. New subscriber.",
    "comment#659": "is that nigel ? in the ending",
    "comment#660": "Is this movie a fiction or a real story🤔",
    "comment#661": "Good movie xx",
    "comment#662": "It realky happend, they lost n came back after 30 years to the earth again..",
    "comment#663": "The strange story of Pan Am Flight 914 which is frequently shared by UFO blogs and conspiracy-minded websites as if it has been stumping the experts for decades. This &quot;unsolved&quot; event reportedly involves a plane that took off from New York in 1955 with 57 passengers, disappeared for 37 years, then reappeared and landed in Miami as if nothing had happened",
    "comment#664": "FLIGHT 914 movie 😍🔥",
    "comment#665": "Do any of you know this Hollywood movie&#39;s (flight 914) exact release date?",
    "comment#666": "The plane landed after 37 years later",
    "comment#667": "👍",
    "comment#668": "Indians also love this movie, strat to end thriller🤯, it&#39;s teach a lot . It&#39;s the greatest movie seen this ever, omg❤",
    "comment#669": "I re-watch this film ❤",
    "comment#670": "Can you please tell me the twist end i didn&#39;t get it what happened at the end",
    "comment#671": "It was really fantastic experience.... Got goosebumps... I enjoyed a lot.",
    "comment#672": "Really an amazing movie I have ever seen.loved it a lot.",
    "comment#673": "What is the name of this main  legendary captain?",
    "comment#674": "Wow !! Great movie !",
    "comment#675": "Great movie",
    "comment#676": "I enjoyed time traveler in this movie ❤👏",
    "comment#677": "The old man has the nigel.. He is the genius.",
    "comment#678": "Plot twist in end was awesome should watch",
    "comment#679": "WORTH WATCHING. PLUS THE TWIST AT THE END ! DAMN I GOT GOOSEBUMPS",
    "comment#680": "I like 💕",
    "comment#681": "Hector was the real hero in this film",
    "comment#682": "This movie is absolutely 👍 great. Worth watching.",
    "comment#683": "Good movie💯absolutely worth to watch......thank you for sharing....😀",
    "comment#684": "Filem yang sangat menarik, saya dari Malaysia 🇲🇾",
    "comment#685": "Ukraine was mentioned. Must be 2022",
    "comment#686": "Seen before in other channel . Thank you .",
    "comment#687": "June 6th 2023",
    "comment#688": "😮",
    "comment#689": "Very good film must watch enjoy peeps 😋",
    "comment#690": "I watched",
    "comment#691": "Good movie thank you for sharing.",
    "comment#692": "June 6th 2023<br>⭐️⭐️⭐️⭐️",
    "comment#693": "Uživala TOTALNO!!!🎉❤ Hvala 🙋💐🙋🇭🇷",
    "comment#694": "Loved this movie. Storyline was good and the little twist in the end just made it even better ❤<br>8/10  stars 🌟 🤩",
    "comment#695": "This movie takes many artistic liberties, but it is generally really well made. Kudos to this movie, I absolutely loved it.<br><br>Many thanks for uploading the movie!",
    "comment#696": "👍👍👍👍👍👍",
    "comment#697": "فلم ممتع حقا مرحبا بك",
    "comment#698": "amusing and entertaining movie.   though a more impossible plot than the terminator paradox.",
    "comment#699": "Really enjoyed the movie from start to end",
    "comment#700": "Thank you.",
    "comment#701": "Bardzo interesujący film pozdrawiam z Polski🇵🇱👍❤️👍"
}